RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_adc_ex.h
/**
  ******************************************************************************
  * @file    stm32u5xx_hal_adc_ex.h
  * @author  MCD Application Team
  * @brief   Header file of ADC HAL extended module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U5xx_HAL_ADC_EX_H
#define STM32U5xx_HAL_ADC_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal_def.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */

/** @addtogroup ADCEx
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup ADCEx_Exported_Types ADC Extended Exported Types
  * @{
  */

/**
  * @brief  ADC Injected Conversion Oversampling structure definition
  */
typedef struct
{
  uint32_t Ratio;                         /*!< Configures the oversampling ratio.
                                               This parameter can be a value of @ref ADC_HAL_EC_OVS_RATIO */

  uint32_t RightBitShift;                 /*!< Configures the division coefficient for the Oversampler.
                                               This parameter can be a value of @ref ADC_HAL_EC_OVS_SHIFT */
} ADC_InjOversamplingTypeDef;

/**
  * @brief  Structure definition of ADC group injected and ADC channel affected to ADC group injected
  * @note   Parameters of this structure are shared within 2 scopes:
  *          - Scope channel: InjectedChannel, InjectedRank, InjectedSamplingTime , InjectedSingleDiff,
  *                           InjectedOffsetNumber, InjectedOffset
  *          - Scope ADC group injected (affects all channels of injected group): InjectedNbrOfConversion,
  *            InjectedDiscontinuousConvMode, AutoInjectedConv, QueueInjectedContext, ExternalTrigInjecConv,
  *            ExternalTrigInjecConvEdge, InjecOversamplingMode, InjecOversampling.
  * @note   The setting of these parameters by function HAL_ADCEx_InjectedConfigChannel() is conditioned to ADC state.
  *         ADC state can be either:
  *          - For all parameters: ADC disabled (this is the only possible ADC state to modify parameter
  *                               'InjectedSingleDiff')
  *          - For parameters 'InjectedDiscontinuousConvMode', 'QueueInjectedContext', 'InjecOversampling':
  *                           ADC enabled without conversion on going on injected group.
  *          - For parameters 'InjectedSamplingTime', 'InjectedOffset', 'InjectedOffsetNumber', 'AutoInjectedConv':
  *                           ADC enabled without conversion on going on regular and injected groups.
  *          - For parameters 'InjectedChannel', 'InjectedRank', 'InjectedNbrOfConversion', 'ExternalTrigInjecConv',
  *                           'ExternalTrigInjecConvEdge': ADC enabled and while conversion on going on ADC groups
  *                            regular and injected.
  *         If ADC is not in the appropriate state to modify some parameters, these parameters setting is bypassed
  *         without error reporting (as it can be the expected behavior in case of intended action to update another
  *         parameter (which fulfills the ADC state condition) on the fly).
  */
typedef struct
{
  uint32_t InjectedChannel;             /*!< Specifies the channel to configure into ADC group injected.
                                             This parameter can be a value of @ref ADC_HAL_EC_CHANNEL
                                             Note: Depending on devices and ADC instances, some channels may not be
                                             available on device package pins. Refer to device datasheet for channels
                                             availability. */

  uint32_t InjectedRank;                /*!< Specifies the rank in the ADC group injected sequencer.
                                             This parameter must be a value of @ref ADC_INJ_SEQ_RANKS.
                                             Note: to disable a channel or change order of conversion sequencer,
                                                   rank containing a previous channel setting can be overwritten by
                                                   the new channel setting (or parameter number of
                                                   conversions adjusted) */

  uint32_t InjectedSamplingTime;        /*!< Sampling time value to be set for the selected channel.
                                             Unit: ADC clock cycles.
                                             Conversion time is the addition of sampling time and processing time
                                             (12.5 ADC clock cycles at ADC resolution 12 bits, 10.5 cycles at 10 bits,
                                             8.5 cycles at 8 bits, 6.5 cycles at 6 bits).
                                             This parameter can be a value of @ref ADC_HAL_EC_CHANNEL_SAMPLINGTIME.
                                             Caution: This parameter applies to a channel that can be used in a
                                                      regular and/or injected group. It overwrites the last setting.
                                             Note: In case of usage of internal measurement channels
                                                  (VrefInt/Vbat/TempSensor), sampling time constraints must be
                                                  respected (sampling time can be adjusted in function of ADC clock
                                                  frequency and sampling time setting);
                                                   Refer to device datasheet for timings values. */

