RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_adc_ex.h
  uint32_t InjectedSingleDiff;          /*!< Selection of single-ended or differential input.
                                             In differential mode: Differential measurement is between the selected
                                             channel 'i' (positive input) and channel 'i+1' (negative input).
                                             Only channel 'i' has to be configured, channel 'i+1' is configured
                                             automatically.
                                             This parameter must be a value of:
                                                  @ref ADC_HAL_EC_CHANNEL_SINGLE_DIFF_ENDING.
                                             Caution: This parameter applies to a channel that can be used in a
                                                      regular and/or injected group.
                                                      It overwrites the last setting.
                                             Note: Refer to Reference Manual to ensure the selected channel is
                                                   available in differential mode.
                                             Note: When configuring a channel 'i' in differential mode, the channel
                                                  'i+1' is not usable separately.
                                             Note: This parameter must be modified when ADC is disabled (before ADC
                                                   start conversion or after ADC stop conversion).
                                             If ADC is enabled, this parameter setting is bypassed without error
                                             reporting (as it can be the expected behavior in case of another parameter
                                             update on the fly) */

  uint32_t InjectedOffsetNumber;        /*!< Selects the offset number.
                                             This parameter can be a value of @ref ADC_HAL_EC_OFFSET_NB.
                                             Caution: Only one offset is allowed per channel. This parameter overwrites
                                             the last setting. */

  uint32_t InjectedOffset;              /*!< Defines the offset to be subtracted from the raw converted data.
                                             Offset value must be a positive number.
                                             Depending of ADC resolution selected (12, 10, 8 or 6 bits), this parameter
                                             must be a number between Min_Data = 0x000 and Max_Data = 0xFFF,  0x3FF,
                                             0xFF or 0x3F respectively.
                                             Note: This parameter must be modified when no conversion is on going on
                                                   both regular and injected groups (ADC disabled, or ADC enabled
                                                   without continuous mode or external trigger that could launch a
                                                   conversion). */

  FunctionalState InjectedOffsetSignedSaturation;  /*!< Specifies whether the Signed saturation feature is used or not.
                                                        This parameter is applied only for 14-bit or 8-bit resolution.
                                                        This parameter can be set to ENABLE or DISABLE. */

  uint32_t InjectedOffsetSign;          /*!< Define if the offset should be subtracted (negative sign) or added
                                             (positive sign) from or to the raw converted data.
                                             This parameter can be a value of @ref ADCEx_OffsetSign.
                                             Note:
                                               - This parameter must be modified when no conversion is on going on both
                                                 regular and injected groups (ADC disabled, or ADC enabled without
                                                 continuous mode or external trigger that could launch a conversion).
                                               - This parameter is specific to ADC1 only. */

  FunctionalState InjectedOffsetSaturation;   /*!< Define if the offset should be saturated upon under or over flow.
                                               This parameter value can be ENABLE or DISABLE.
                                               Note:
                                                     - This parameter must be modified when no conversion is on going
                                                       on both regular and injected groups (ADC disabled, or ADC
                                                       enabled without continuous mode or external trigger that could
                                                       launch a conversion).
                                                     - This parameter is specific to ADC1 only. */


  uint32_t InjectedLeftBitShift;        /*!< Configures the left shifting applied to the final result with or without
                                             oversampling.
                                            This parameter can be a value of @ref ADCEx_Left_Bit_Shift */

  uint32_t InjectedNbrOfConversion;     /*!< Specifies the number of ranks that will be converted within
                                             the ADC group injected sequencer.
                                             To use the injected group sequencer and convert several ranks,
                                             parameter 'ScanConvMode' must be enabled.
                                             This parameter must be a number between Min_Data = 1 and Max_Data = 4.
                                             Caution: this setting impacts the entire injected group.
                                                      Therefore, call of HAL_ADCEx_InjectedConfigChannel() to
                                                      configure a channel on injected group can impact the
                                                      configuration of other channels previously set. */

