RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_adc_ex.h
  FunctionalState InjectedDiscontinuousConvMode; /*!< Specifies whether the conversions sequence of ADC group injected
                                                      is performed in Complete-sequence/Discontinuous-sequence
                                                      (main sequence subdivided in successive parts).
                                                      Discontinuous mode is used only if sequencer is enabled
                                                      (parameter 'ScanConvMode').
                                                      If sequencer is disabled, this parameter is discarded.
                                                      Discontinuous mode can be enabled only if continuous
                                                      mode is disabled.
                                                      This parameter can be set to ENABLE or DISABLE.
                                                      Note: This parameter must be modified when ADC is disabled
                                                           (before ADC start conversion or after ADC stop conversion).
                                                      Note: For injected group, discontinuous mode converts the
                                                            sequence channel by channel (discontinuous length
                                                            fixed to 1 rank).
                                                      Caution: this setting impacts the entire injected group.
                                                               Therefore, call of HAL_ADCEx_InjectedConfigChannel() to
                                                               configure a channel on injected group can impact the
                                                               configuration of other channels previously set. */

  FunctionalState AutoInjectedConv;    /*!< Enables or disables the selected ADC group injected automatic conversion
                                            after regular one
                                            This parameter can be set to ENABLE or DISABLE.
                                            Note: To use Automatic injected conversion, discontinuous mode must be
                                                  disabled ('DiscontinuousConvMode' and 'InjectedDiscontinuousConvMode'
                                                  set to DISABLE)
                                            Note: To use Automatic injected conversion, injected group external triggers
                                                  must be disabled ('ExternalTrigInjecConv' set to
                                                  ADC_INJECTED_SOFTWARE_START)
                                            Note: In case of DMA used with regular group: if DMA configured in normal
                                                  mode (single shot) JAUTO will be stopped upon DMA transfer complete.
                                                  To maintain JAUTO always enabled,
                                                  DMA must be configured in circular mode.
                                            Caution: this setting impacts the entire injected group.
                                                     Therefore, call of HAL_ADCEx_InjectedConfigChannel() to
                                                     configure a channel on injected group can impact the configuration
                                                     of other channels previously set. */

  uint32_t ExternalTrigInjecConv;     /*!< Selects the external event used to trigger the conversion start of
                                           injected group.
                                           If set to ADC_INJECTED_SOFTWARE_START, external triggers are disabled
                                           and software trigger is used instead.
                                           This parameter can be a value of @ref ADC_injected_external_trigger_source.
                                           Caution: this setting impacts the entire injected group. Therefore, call of
                                                    HAL_ADCEx_InjectedConfigChannel() to configure a channel on
                                                    injected group can impact the configuration of other channels
                                                    previously set. */

  uint32_t ExternalTrigInjecConvEdge; /*!< Selects the external trigger edge of injected group.
                                           This parameter can be a value of @ref ADC_injected_external_trigger_edge.
                                           If trigger source is set to ADC_INJECTED_SOFTWARE_START, this parameter
                                           is discarded.
                                           Caution: this setting impacts the entire injected group.
                                                    Therefore, call of HAL_ADCEx_InjectedConfigChannel() to configure a
                                                    channel on injected group can impact the configuration of other
                                                    channels previously set. */

  FunctionalState InjecOversamplingMode;    /*!< Specifies whether the oversampling feature is enabled or disabled.
                                                 This parameter can be set to ENABLE or DISABLE.
                                                 Note: This parameter can be modified only if there is no conversion is
                                                       ongoing (both ADSTART and JADSTART cleared). */

  ADC_InjOversamplingTypeDef  InjecOversampling; /*!< Specifies the Oversampling parameters.
                                                      Caution: this setting overwrites the previous oversampling
                                                               configuration if oversampling already enabled.
                                                      Note: This parameter can be modified only if there is no
                                                            conversion is ongoing (both ADSTART and
                                                            JADSTART cleared).*/
} ADC_InjectionConfTypeDef;

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Structure definition of ADC multimode
  * @note   The setting of these parameters by function HAL_ADCEx_MultiModeConfigChannel() is conditioned by ADCs
  *         state (both Master and Slave ADCs).
  *         Both Master and Slave ADCs must be disabled.
  */
typedef struct
{
  uint32_t Mode;              /*!< Configures the ADC to operate in independent or multimode.
                                   This parameter can be a value of @ref ADC_HAL_EC_MULTI_MODE. */

  uint32_t DualModeData;      /*!< Configures the Dual ADC Mode Data Format:
                                   This parameter can be a value of @ref ADCEx_Dual_Mode_Data_Format */

  uint32_t TwoSamplingDelay;  /*!< Configures the Delay between 2 sampling phases.
                                   This parameter can be a value of @ref ADC_HAL_EC_MULTI_TWOSMP_DELAY.
                                   Delay range depends on selected resolution:
                                    from 1 to 12 clock cycles for 12 bits, from 1 to 10 clock cycles for 10 bits,
                                    from 1 to 8 clock cycles for 8 bits, from 1 to 6 clock cycles for 6 bits.     */
} ADC_MultiModeTypeDef;
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

